---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctType
source: html/4802d717-557b-7b63-5b3d-fff54308bb06.htm
---
# DuctType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.